app/controllers/sites_controller.rb

SELECT "sites".* FROM "sites" ORDER BY title desc
---
  def index
   # @sites = Site.all
 @sites=Site.paginate :page=>params[:site], :order=>'created_at desc',
:per_page => 5

SELECT "sites".* FROM "sites" WHERE "sites"."id" = ? ORDER BY title desc LIMIT 1  [["id", "980190962"]]
---
  def show
    @site = Site.find(params[:id])

SELECT "sites".* FROM "sites" WHERE "sites"."id" = ? ORDER BY title desc LIMIT 1  [["id", "980190962"]]
---
  def edit
    @site = Site.find(params[:id])

INSERT INTO "sites" ("body", "created_at", "permalink", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "site"], ["created_at", Fri, 02 Mar 2012 00:00:00 UTC +00:00], ["permalink", "cms"], ["title", "cms"], ["updated_at", Tue, 03 Jul 2012 00:00:00 UTC +00:00]]
---
  def create
    @site = Site.new(params[:site])

    respond_to do |format|
      if @site.save

SELECT "sites".* FROM "sites" WHERE "sites"."id" = ? ORDER BY title desc LIMIT 1  [["id", "980190962"]]
UPDATE "sites" SET "title" = 'cms', "body" = 'site', "permalink" = 'cms', "created_at" = '2012-03-02 00:00:00.000000', "updated_at" = '2012-07-03 00:00:00.000000' WHERE "sites"."id" = 980190962
---
  def update
    @site = Site.find(params[:id])

    respond_to do |format|
      if @site.update_attributes(params[:site])

SELECT "sites".* FROM "sites" WHERE "sites"."id" = ? ORDER BY title desc LIMIT 1  [["id", "980190962"]]
DELETE FROM "sites" WHERE "sites"."id" = ?  [["id", 980190962]]
---
  def destroy
    @site = Site.find(params[:id])
    @site.destroy