app/controllers/store_controller.rb

SELECT "sites".* FROM "sites" ORDER BY title desc
---
  def index
    @sites = Site.all